sde3.log
PIERCE BUZHARDT
CPSC 3520

?- vector(v1, V1),vector(v1,V2),distanceR2(V1,V2,D).
V1 = V2, V2 = [1.0, 2.0, 3.0],
D = 0 ;
V1 = V2, V2 = [1.0, 2.0, 3.0],
D = 0.0.

?- distanceR2([1,2,3],[2,4,6],D).
D = 14.

?- distanceR2([5,5,5,5,5],[3,3,3,3,3],H).
H = 20.


?- h(ts1,H), nth0(1,H,Second),distanceSqAllMeans(Second,H,What).
H = [[47.698002, 62.48], [-49.005001, -41.327999], [45.958, 29.403], [-60.546001, -50.702], [45.403, 52.994999], [-49.021, -52.053001], [29.788, 58.993], [-40.433998|...]],
Second = [-49.005001, -41.327999],
What = [20127.571445602007, 0, 14020.845778464001, 221.0665757480009, 17809.698604524005, 115.02592386800508, 16272.639846944003, 98.11331742600892].

?- h(ts1,H), nth0(4,H,Second),distanceSqAllMeans(Second,H,What).
H = [[47.698002, 62.48], [-49.005001, -41.327999], [45.958, 29.403], [-60.546001, -50.702], [45.403, 52.994999], [-49.021, -52.053001], [29.788, 58.993], [-40.433998|...]],
Second = [45.403, 52.994999],
What = [95.23227815000496, 17809.698604524005, 556.8904418160012, 21978.258414504002, 0, 19950.97408, 279.804240996001, 15352.842032220007].

?- bigH(H), nth0(9,H,Second),distanceSqAllMeans(Second,H,What).
H = [[47.698002, 62.48], [-49.005001, -41.327999], [45.958, 29.403], [-60.546001, -50.702], [45.403, 52.994999], [-49.021, -52.053001], [29.788, 58.993], [-40.433998|...], [...|...]|...],
Second = [-56.348, -68.390999],
What = [27952.788911442003, 786.3256033140008, 20030.183876411997, 330.52389801800183, 25087.826511456005, 320.6151076480037, 23646.093697231998, 1279.0482436560035, 20654.554167204|...].


?- vector(v1,V1),listMinPos(V1, Pos).
V1 = [1.0, 2.0, 3.0],
Pos = 0.

?- vector(v2,V1),listMinPos(V1, Pos).
V1 = [3.0, 2.0, 1.0],
Pos = 2.

?- listMinPos([55,8,23,-3,645,-88], Pos).
Pos = 5.


?- vector(v1,V1),vector(v2,V2),elsum(V1,V2,Answer).
V1 = [1.0, 2.0, 3.0],
V2 = [3.0, 2.0, 1.0],
Answer = [4.0, 4.0, 4.0].

?- elsum([3,3,3],[6,6,6],Answer).
Answer = [9, 9, 9].

?- elsum([-3,-3,-3,-3,-3],[9,8,7,6,5],Answer).
Answer = [6, 5, 4, 3, 2].


?- scaleList([-3,-3,-3,-3,-3],3,Answer).
Answer = [-1, -1, -1, -1, -1].

?- scaleList([6,3,0,4],3,Answer).
Answer = [2, 1, 0, 1.3333333333333333].

?- scaleList([0,0,0],3,Answer).
Answer = [0, 0, 0].


?- zeroes(0,List).
List = [].

?- zeroes(9,List).
List = [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0].

?- zeroes(4,List).
List = [0.0, 0.0, 0.0, 0.0].


?- zeroMeansSet(5,5,Set).
Set = [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0|...]].

?- zeroMeansSet(5,1,Set).
Set = [[0.0], [0.0], [0.0], [0.0], [0.0]].

?- zeroMeansSet(0,1,Set).
Set = [].


?- zeroVdiff([0,0,0],[0,0,1]).
false.

?- zeroVdiff([0,0,0],[0,0,0]).
true.

?- zeroVdiff([0,0,0],[0,0,0,3]).
false.


?- zeroSetDiff([[1,2,3,4],[4,3,2,1]],[[1,2,3,4],[4,3,2,1]]).
true.

?- zeroSetDiff([[1,2,3,4],[4,3,2,0]],[[0,2,3,4],[4,3,2,1]]).
false.

?- zeroSetDiff([[],[]],[[],[]]).
true.


?- zeroCounts(3, O).
O = [0, 0, 0].

?- zeroCounts(9, O).
O = [0, 0, 0, 0, 0, 0, 0, 0, 0].

?- zeroCounts(0, O).
O = [].


?- updateCounts(3,[3,3,3,3,3],G).
G = [3, 3, 3, 4, 3].

?- updateCounts(3,[3,3,3,3,3],G),updateCounts(0,G,H).
G = [3, 3, 3, 4, 3],
H = [4, 3, 3, 4, 3].

?- updateCounts(3,[3,3,3,3,3],G),updateCounts(0,G,H),updateCounts(2,H,I).
G = [3, 3, 3, 4, 3],
H = [4, 3, 3, 4, 3],
I = [4, 3, 4, 4, 3].


?- zeroMeansSet(3,3,M),updateMeansSum([5,3,-8],1,M,N).
M = [[0.0, 0.0, 0.0], [0.0, 0.0, 0.0], [0.0, 0.0, 0.0]],
N = [[0.0, 0.0, 0.0], [5.0, 3.0, -8.0], [0.0, 0.0, 0.0]].

?- zeroMeansSet(3,3,M),updateMeansSum([5,3,-8],1,M,N),updateMeansSum([1,1,1],0,N,P).
M = [[0.0, 0.0, 0.0], [0.0, 0.0, 0.0], [0.0, 0.0, 0.0]],
N = [[0.0, 0.0, 0.0], [5.0, 3.0, -8.0], [0.0, 0.0, 0.0]],
P = [[1.0, 1.0, 1.0], [5.0, 3.0, -8.0], [0.0, 0.0, 0.0]].

?- zeroMeansSet(3,3,M),updateMeansSum([5,3,-8],1,M,N),updateMeansSum([1,1,1],0,N,P),updateMeansSum([-9,-9,-9],2,P,Result).
M = [[0.0, 0.0, 0.0], [0.0, 0.0, 0.0], [0.0, 0.0, 0.0]],
N = [[0.0, 0.0, 0.0], [5.0, 3.0, -8.0], [0.0, 0.0, 0.0]],
P = [[1.0, 1.0, 1.0], [5.0, 3.0, -8.0], [0.0, 0.0, 0.0]],
Result = [[1.0, 1.0, 1.0], [5.0, 3.0, -8.0], [-9.0, -9.0, -9.0]].


?- formNewMeans([[55,33],[2,1]],[11,2],New).
New = [[5, 3], [1, 0.5]].

?- formNewMeans([[55,33],[2,1]],[0,2],New).
New = [[55, 33], [1, 0.5]].

?- formNewMeans([[5],[2]],[8,2],New).
New = [[0.625], [1]].


?- h(ts2,H), reclassify(H,[[0,0],[5,-3],[2,2]],NewMu).
H = [[47.698002, 62.48], [-49.005001, -41.327999]],
NewMu = [[-49.005001, -41.327999], [0.0, 0.0], [47.698002, 62.48]].

?- h(ts2,H), reclassify(H,[[0,0],[5,-3],[2,2]],NewMu), reclassify(H, NewMu, NewNewMu).
H = [[47.698002, 62.48], [-49.005001, -41.327999]],
NewMu = NewNewMu, NewNewMu = [[-49.005001, -41.327999], [0.0, 0.0], [47.698002, 62.48]].

?- h(ts2,H), reclassify(H,[[0,0],[5,-3],[2,2]],NewMu), reclassify(H, NewMu, NewNewMu),reclassify(H,NewNewMu,NewNewNeoMu).
H = [[47.698002, 62.48], [-49.005001, -41.327999]],
NewMu = NewNewMu, NewNewMu = NewNewNeoMu, NewNewNeoMu = [[-49.005001, -41.327999], [0.0, 0.0], [47.698002, 62.48]].

?- bigH(H), cmeans(H,[[1,1],[-1,-1]],Final).
H = [[47.698002, 62.48], [-49.005001, -41.327999], [45.958, 29.403], [-60.546001, -50.702], [45.403, 52.994999], [-49.021, -52.053001], [29.788, 58.993], [-40.433998|...], [...|...]|...],
Final = [[48.58256019999999, 49.11889989], [-51.10444003000001, -52.52021005000002]].

?- bigH(H), cmeans(H,[[1,1],[-1,-1],[-1,1]],Final).
H = [[47.698002, 62.48], [-49.005001, -41.327999], [45.958, 29.403], [-60.546001, -50.702], [45.403, 52.994999], [-49.021, -52.053001], [29.788, 58.993], [-40.433998|...], [...|...]|...],
Final = [[48.58256019999999, 49.11889989], [-51.10444003000001, -52.52021005000002], [0.0, 0.0]].

?- bigH(H), cmeans(H,[[1,1],[-1,-1],[-8,1]],Final).
H = [[47.698002, 62.48], [-49.005001, -41.327999], [45.958, 29.403], [-60.546001, -50.702], [45.403, 52.994999], [-49.021, -52.053001], [29.788, 58.993], [-40.433998|...], [...|...]|...],
Final = [[48.58256019999999, 49.11889989], [0.0, 0.0], [-51.10444003000001, -52.52021005000002]].
